# -*- coding: utf-8 -*-
from flask import Flask
import random

app = Flask(__name__)

facts = [
    "просмотр контента.Илон Маск также выступает за регулирование социальных сетей и защиту личных данных пользователей. Он утверждает, что социальные сети собирают огромное количество информации о нас, которую потом можно использовать для манипулирования нашими мыслями и поведением.",
    "Изучение технологической зависимости является одной из наиболее актуальных областей научных исследований в настоящее время.",
    "Согласно исследованию, проведенному в 2019 году, более 60% людей отвечают на рабочие сообщения в своих смартфонах в течение 15 минут после того, как они вышли с работы."
]

@app.route("/")
def index():
    return '<h1>Hello, World!Чтобы факт увидеть допиши /fact</h1><a href=/fact>http://127.0.0.1:4567/fact</a>'

@app.route("/fact")
def show_fact():
    return f"<p>{random.choice(facts)}</p><h>вернутся убери fact и всë если не додумался"

@app.route("/secret")
def secret():
    return '<h1>Сер вы тут не должны тут быть за это вас растреляют завтра вечером и когда-нибуть вас восресять и опять растреляют и так по кругу :)</h1>'

app.run(debug=True, port=4567)